cmsis-svd/cmsis-svd/data/Spansion/MB9AF12xK.svd
        <!-- REGISTER "WFG_WFSA54" -->
        <register derivedFrom="WFG_WFSA10">
          <name>WFG_WFSA54</name>
          <description> register WFG_WFSA54 </description>
          <addressOffset>0x94</addressOffset>
        </register>
        <!-- REGISTER "WFG_WFTM10" -->
        <register>
          <name>WFG_WFTM10</name>
          <description> register WFG_WFTM10 </description>
          <addressOffset>0x80</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <!-- REGISTER "WFG_WFTM32" -->
        <register derivedFrom="WFG_WFTM10">
          <name>WFG_WFTM32</name>
          <description> register WFG_WFTM32 </description>
          <addressOffset>0x84</addressOffset>
        </register>
        <!-- REGISTER "WFG_WFTM54" -->
        <register derivedFrom="WFG_WFTM10">
          <name>WFG_WFTM54</name>
          <description> register WFG_WFTM54 </description>
          <addressOffset>0x88</addressOffset>
        </register>
        <!-- REGISTER "WFG_NZCL" -->
        <register>
          <name>WFG_NZCL</name>
          <description> register WFG_NZCL </description>
          <addressOffset>0x9C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x001F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DTIE" -->
            <field>
              <name>DTIE</name>
              <description> bitfield DTIE </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "NWS" -->
            <field>
              <name>NWS</name>
              <description> bitfield NWS </description>
              <lsb>1</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SDTI" -->
            <field>
              <name>SDTI</name>
              <description> bitfield SDTI </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WFG_WFIR" -->
        <register>
          <name>WFG_WFIR</name>
          <description> register WFG_WFIR </description>
          <addressOffset>0x98</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFF3</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DTIF" -->
            <field>
              <name>DTIF</name>
              <description> bitfield DTIF </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "DTIC" -->
            <field>
              <name>DTIC</name>
              <description> bitfield DTIC </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "TMIF10" -->
            <field>
              <name>TMIF10</name>
              <description> bitfield TMIF10 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TMIC10" -->
            <field>
              <name>TMIC10</name>
              <description> bitfield TMIC10 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "TMIE10" -->
            <field>
              <name>TMIE10</name>
              <description> bitfield TMIE10 </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TMIS10" -->
            <field>
              <name>TMIS10</name>
              <description> bitfield TMIS10 </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "TMIF32" -->
            <field>
              <name>TMIF32</name>
              <description> bitfield TMIF32 </description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TMIC32" -->
            <field>
              <name>TMIC32</name>
              <description> bitfield TMIC32 </description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "TMIE32" -->
            <field>
              <name>TMIE32</name>
              <description> bitfield TMIE32 </description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TMIS32" -->
            <field>
              <name>TMIS32</name>
              <description> bitfield TMIS32 </description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "TMIF54" -->
            <field>
              <name>TMIF54</name>
              <description> bitfield TMIF54 </description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TMIC54" -->
            <field>
              <name>TMIC54</name>
              <description> bitfield TMIC54 </description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "TMIE54" -->
            <field>
              <name>TMIE54</name>
              <description> bitfield TMIE54 </description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TMIS54" -->
            <field>
              <name>TMIS54</name>
              <description> bitfield TMIS54 </description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ICU_ICFS10" -->
        <register>
          <name>ICU_ICFS10</name>
          <description> register ICU_ICFS10 </description>
          <addressOffset>0x60</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FSI0" -->
            <field>
              <name>FSI0</name>
              <description> bitfield FSI0 </description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FSI1" -->
            <field>
              <name>FSI1</name>
              <description> bitfield FSI1 </description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
