cmsis-svd/cmsis-svd/data/Spansion/MB9AF12xK.svd
        <!-- REGISTER "EPFR06" -->
        <register>
          <name>EPFR06</name>
          <description> register EPFR06 </description>
          <addressOffset>0x618</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xF000F0FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "EINT15S" -->
            <field>
              <name>EINT15S</name>
              <description> bitfield EINT15S </description>
              <lsb>30</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT14S" -->
            <field>
              <name>EINT14S</name>
              <description> bitfield EINT14S </description>
              <lsb>28</lsb>
              <msb>29</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT07S" -->
            <field>
              <name>EINT07S</name>
              <description> bitfield EINT07S </description>
              <lsb>14</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT06S" -->
            <field>
              <name>EINT06S</name>
              <description> bitfield EINT06S </description>
              <lsb>12</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT03S" -->
            <field>
              <name>EINT03S</name>
              <description> bitfield EINT03S </description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT02S" -->
            <field>
              <name>EINT02S</name>
              <description> bitfield EINT02S </description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT01S" -->
            <field>
              <name>EINT01S</name>
              <description> bitfield EINT01S </description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT00S" -->
            <field>
              <name>EINT00S</name>
              <description> bitfield EINT00S </description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EPFR07" -->
        <register>
          <name>EPFR07</name>
          <description> register EPFR07 </description>
          <addressOffset>0x61C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0FC0FFF0</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SCK3B" -->
            <field>
              <name>SCK3B</name>
              <description> bitfield SCK3B </description>
              <lsb>26</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOT3B" -->
            <field>
              <name>SOT3B</name>
              <description> bitfield SOT3B </description>
              <lsb>24</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SIN3S" -->
            <field>
              <name>SIN3S</name>
              <description> bitfield SIN3S </description>
              <lsb>22</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCK1B" -->
            <field>
              <name>SCK1B</name>
              <description> bitfield SCK1B </description>
              <lsb>14</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOT1B" -->
            <field>
              <name>SOT1B</name>
              <description> bitfield SOT1B </description>
              <lsb>12</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SIN1S" -->
            <field>
              <name>SIN1S</name>
              <description> bitfield SIN1S </description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCK0B" -->
            <field>
              <name>SCK0B</name>
              <description> bitfield SCK0B </description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOT0B" -->
            <field>
              <name>SOT0B</name>
              <description> bitfield SOT0B </description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SIN0S" -->
            <field>
              <name>SIN0S</name>
              <description> bitfield SIN0S </description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EPFR08" -->
        <register>
          <name>EPFR08</name>
          <description> register EPFR08 </description>
          <addressOffset>0x620</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0FFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SCK5B" -->
            <field>
              <name>SCK5B</name>
              <description> bitfield SCK5B </description>
              <lsb>14</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOT5B" -->
            <field>
              <name>SOT5B</name>
              <description> bitfield SOT5B </description>
              <lsb>12</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SIN5S" -->
            <field>
              <name>SIN5S</name>
              <description> bitfield SIN5S </description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EPFR09" -->
        <register>
          <name>EPFR09</name>
          <description> register EPFR09 </description>
          <addressOffset>0x624</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000F000</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ADTRG0S" -->
            <field>
              <name>ADTRG0S</name>
              <description> bitfield ADTRG0S </description>
              <lsb>12</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EPFR10" -->
        <register>
          <name>EPFR10</name>
          <description> register EPFR10 </description>
          <addressOffset>0x628</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
        </register>
